import psycopg2

conn = psycopg2.connect(
    dbname="university",
    user="admin",
    password="admin",
    host="localhost",
    port="5432"
)
cursor = conn.cursor()

# Додання даних
students = [
    ("Іваненко", "Іван", "Іванович", "вул. Центральна, 1", "1234567890", 1, "Економіки", "Е-101", True),
    ("Петренко", "Петро", "Петрович", "вул. Молодіжна, 5", "0987654321", 2, "Інформаційних технологій", "ІТ-201", False),
    ("Коваленко", "Марія", "Іванівна", "вул. Шевченка, 10", "0671234567", 3, "Аграрного менеджменту", "АМ-301", False),
    ("Гончарук", "Олег", "Олександрович", "вул. Миру, 8", "0509876543", 4, "Економіки", "Е-401", False),
    ("Сидоренко", "Анна", "Миколаївна", "вул. Гагаріна, 15", "0934567890", 1, "Інформаційних технологій", "ІТ-102", False),
    ("Тимошенко", "Олександр", "Юрійович", "вул. Лесі Українки, 20", "0639871234", 2, "Аграрного менеджменту", "АМ-202", True),
    ("Дяченко", "Катерина", "Петрівна", "вул. Вишнева, 25", "0506547891", 3, "Економіки", "Е-303", False),
    ("Мельник", "Артем", "Богданович", "вул. Квіткова, 30", "0681230987", 4, "Інформаційних технологій", "ІТ-402", False),
    ("Романенко", "Юлія", "Володимирівна", "вул. Тараса Бульби, 12", "0932345678", 1, "Аграрного менеджменту", "АМ-103", False),
    ("Шевченко", "Віктор", "Миколайович", "вул. Паркова, 7", "0673456789", 2, "Економіки", "Е-202", False),
    ("Жукова", "Олена", "Олександрівна", "вул. Дружби, 5", "0504567890", 3, "Інформаційних технологій", "ІТ-301", True)
]


subjects = [
    ("Математика", 90, 2),
    ("Програмування", 120, 2),
    ("Економіка", 60, 1)
]

exams = [
    ("2024-01-15", 1, 1, 5),
    ("2024-01-20", 2, 2, 4),
    ("2024-01-25", 3, 1, 3),
    ("2024-01-27", 4, 2, 4),
    ("2024-01-30", 5, 3, 5),
    ("2024-02-01", 6, 1, 2),
    ("2024-02-03", 7, 2, 3),
    ("2024-02-05", 8, 3, 4),
    ("2024-02-08", 9, 1, 5),
    ("2024-02-10", 10, 2, 4),
    ("2024-02-12", 1, 3, 3),
    ("2024-02-15", 2, 1, 4),
    ("2024-02-18", 3, 2, 5),
    ("2024-02-20", 4, 3, 4),
    ("2024-02-23", 5, 1, 3),
    ("2024-02-25", 6, 2, 2),
    ("2024-02-27", 7, 3, 5),
    ("2024-03-01", 8, 1, 4),
    ("2024-03-03", 9, 2, 3),
    ("2024-03-05", 10, 3, 4),
    ("2024-03-08", 1, 2, 5),
    ("2024-03-10", 2, 3, 3)
]

# Заповнення таблиць
cursor.executemany("""
INSERT INTO Students (last_name, first_name, middle_name, address, phone, course, faculty, group_name, is_headman)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
""", students)

cursor.executemany("""
INSERT INTO Subjects (name, hours_per_semester, semesters)
VALUES (%s, %s, %s)
""", subjects)

cursor.executemany("""
INSERT INTO Exams (exam_date, student_id, subject_id, grade)
VALUES (%s, %s, %s, %s)
""", exams)

conn.commit()
print("Дані успішно додано.")
cursor.close()
conn.close()
